In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
datatime = np.array(['year','month','day'])
frame = DataFrame({
    '1':['1','2','3'],'2':['4','5','6']
},index=datatime)
frame

       1  2
year   1  4
month  2  5
day    3  6

In [5]:
frame[0:1]

      1  2
year  1  4

In [7]:
frame.loc['year']

1    1
2    4
Name: year, dtype: object

In [8]:
frame[3] = 12
frame

       1  2   3
year   1  4  12
month  2  5  12
day    3  6  12

In [9]:
frame[4] = np.arange(3)
frame

       1  2   3  4
year   1  4  12  0
month  2  5  12  1
day    3  6  12  2

In [10]:
frame[5] = Series([1,2,3,4])
frame

       1  2   3  4   5
year   1  4  12  0 NaN
month  2  5  12  1 NaN
day    3  6  12  2 NaN

In [11]:
frame

       1  2   3  4   5
year   1  4  12  0 NaN
month  2  5  12  1 NaN
day    3  6  12  2 NaN

In [13]:
del frame[5]
frame

       1  2   3  4
year   1  4  12  0
month  2  5  12  1
day    3  6  12  2

In [15]:
frame.T
frame

       1  2   3  4
year   1  4  12  0
month  2  5  12  1
day    3  6  12  2

In [16]:
frame

       1  2   3  4
year   1  4  12  0
month  2  5  12  1
day    3  6  12  2

In [17]:
frame.T

  year month day
1    1     2   3
2    4     5   6
3   12    12  12
4    0     1   2

In [18]:
frame

       1  2   3  4
year   1  4  12  0
month  2  5  12  1
day    3  6  12  2

In [20]:
frame.T['hour'] = np.NAN
frame

       1  2   3  4
year   1  4  12  0
month  2  5  12  1
day    3  6  12  2

In [21]:
frame.T

  year month day
1    1     2   3
2    4     5   6
3   12    12  12
4    0     1   2

In [22]:
frame = frame.T
frame['hour'] = np.NAN
frame.T
frame

  year month day  hour
1    1     2   3   NaN
2    4     5   6   NaN
3   12    12  12   NaN
4    0     1   2   NaN

In [23]:
frame.iloc[1,3] = 2
frame

  year month day  hour
1    1     2   3   NaN
2    4     5   6   2.0
3   12    12  12   NaN
4    0     1   2   NaN

In [25]:
frame.index

Index(['1', '2', 3, 4], dtype='object')

In [26]:
frame.name = 'date'
frame.index.name = 'time'
frame

     year month day  hour
time
1       1     2   3   NaN
2       4     5   6   2.0
3      12    12  12   NaN
4       0     1   2   NaN

In [27]:
frame.isnull()

       year  month    day   hour
time
1     False  False  False   True
2     False  False  False  False
3     False  False  False   True
4     False  False  False   True

In [28]:
frame.isnull().index

Index(['1', '2', 3, 4], dtype='object', name='time')

In [33]:
frame= frame.T

In [36]:
frame[4]!= np.NAN

year     True
month    True
day      True
hour     True
Name: 4, dtype: bool

In [38]:
(frame[4]!= np.NAN).index

Index(['year', 'month', 'day', 'hour'], dtype='object')

In [39]:
frame

time     1  2    3    4
year     1  4   12    0
month    2  5   12    1
day      3  6   12    2
hour   NaN  2  NaN  NaN

In [40]:
frame = frame.T
frame

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [44]:
frame_index = frame.index
frame_index

Index(['1', '2', 3, 4], dtype='object', name='time')

In [46]:
frame_index.delete(3)

Index(['1', '2', 3], dtype='object', name='time')

In [47]:
frame

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [51]:
frame.loc[frame_index,:]

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [52]:
frame_index

Index(['1', '2', 3, 4], dtype='object', name='time')

In [57]:
frame.loc[frame_index.delete(3),:]

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN

In [58]:
frame

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [65]:
frame1 = frame.loc[frame_index.delete(3),:]

In [68]:
frame1

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN

In [70]:
frame2 = frame1.reindex([1,])
# dropaxis = 1
frame

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [72]:
frame

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [73]:
frame<2

      year  month   day  hour
time
1     True   True  True  True
2     True   True  True  True
3     True   True  True  True
4     True   True  True  True

In [74]:
frame.values

array([['1', '2', '3', nan],
       ['4', '5', '6', 2.0],
       [12, 12, 12, nan],
       [0, 1, 2, nan]], dtype=object)

In [76]:
frame[frame<2]

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [77]:
frame[frame>10]

     year month day hour
time
1       1     2   3  NaN
2       4     5   6    2
3      12    12  12  NaN
4       0     1   2  NaN

In [78]:
dataset = DataFrame({
    1:{1:1,2:2,3:3},2:{1:4,2:5,3:6}
})
dataset

   1  2
1  1  4
2  2  5
3  3  6

In [83]:
dataset1 = dataset[dataset<3]
dataset

   1  2
1  1  4
2  2  5
3  3  6

In [85]:
print(dataset1)
dataset1.dropna()

     1   2
1  1.0 NaN
2  2.0 NaN
3  NaN NaN

Empty DataFrame
Columns: [1, 2]
Index: []

In [86]:
data = DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [92]:
data.loc['Ohio']
print(data.loc[:,'one'])

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [96]:
data[1:2]
print(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
index1 = Series(np.array(['Ohio','Utah']))
data.loc[index1]

      one  two  three  four
Ohio    0    1      2     3
Utah    8    9     10    11

In [ ]:
# data[]    
#    DataFrame
# data.loc[] ,
# data.iloc[] index

In [101]:
data1 = DataFrame(np.arange(12).reshape((3,4)),columns = ['a','b','d','e'],index=Series(np.arange(3)))
data1.loc[1,'d'] = np.NAN
data1

   a  b     d   e
0  0  1   2.0   3
1  4  5   NaN   7
2  8  9  10.0  11

In [100]:
data2 = DataFrame(np.arange(16).reshape(4,4),columns=['a','b','c','f'],index = Series(np.arange(1,5)))
data2

    a   b   c   f
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [102]:
data3 = data1 + data2 
data3

      a     b   c   d   e   f
0   NaN   NaN NaN NaN NaN NaN
1   4.0   6.0 NaN NaN NaN NaN
2  12.0  14.0 NaN NaN NaN NaN
3   NaN   NaN NaN NaN NaN NaN
4   NaN   NaN NaN NaN NaN NaN

In [103]:
data1.add(data2,fill_value = 0)

      a     b     c     d     e     f
0   0.0   1.0   NaN   2.0   3.0   NaN
1   4.0   6.0   2.0   NaN   7.0   3.0
2  12.0  14.0   6.0  10.0  11.0   7.0
3   8.0   9.0  10.0   NaN   NaN  11.0
4  12.0  13.0  14.0   NaN   NaN  15.0

In [104]:
data2.add(data1,fill_value= 0)

      a     b     c     d     e     f
0   0.0   1.0   NaN   2.0   3.0   NaN
1   4.0   6.0   2.0   NaN   7.0   3.0
2  12.0  14.0   6.0  10.0  11.0   7.0
3   8.0   9.0  10.0   NaN   NaN  11.0
4  12.0  13.0  14.0   NaN   NaN  15.0

In [ ]:
#  axis serieslable

In [105]:
# numpyufuncspandas
f = DataFrame(np.random.randn(16).reshape((4,4)),index = np.arange(4),columns=list('abcd'))
f

          a         b         c         d
0  0.176800 -1.260995  0.156340 -0.940641
1 -0.941745  0.252078  0.880245 -0.043011
2  1.016642 -0.912353  0.447731 -0.022564
3 -1.036924 -0.479484 -0.498969 -0.121543

In [106]:
np.abs(f)

          a         b         c         d
0  0.176800  1.260995  0.156340  0.940641
1  0.941745  0.252078  0.880245  0.043011
2  1.016642  0.912353  0.447731  0.022564
3  1.036924  0.479484  0.498969  0.121543

In [107]:
# DataFrameapply
x = lambda x : x.max() - x.min()
f.apply(x)

a    2.053566
b    1.513073
c    1.379214
d    0.918077
dtype: float64

In [108]:
# 
f.apply(x,axis=1)

0    1.437795
1    1.821990
2    1.928995
3    0.915381
dtype: float64

In [109]:
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [110]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [111]:
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [112]:
obj = Series(np.arange(8),index=list('aaabddfs'))

In [113]:
obj

a    0
a    1
a    2
b    3
d    4
d    5
f    6
s    7
dtype: int32

In [114]:
obj.index.is_unique

False

In [116]:
obj.idxmax()

's'